Revit 2027 API
BuiltInFailures.SketchFailures.NoPlane Property
 Highlighted geometry no longer determines a plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoPlane { get; }
Public Shared ReadOnly Property NoPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoPlane {
	FailureDefinitionId^ get ();
}
static member NoPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace